{
    "card": {
      "home": "Accueil",
      "about": "À propos",
      "projects": "Projets",
      "contact": "Me contacter"
    },
    "home": {
      "name": "Bienvenue, je suis Thomas",
      "job": "Developpeur Integrateur Web Junior"
    },
    "about": {
      "welcome": "Thomas Guyot",
      "location": "Region parisienne - À distance",
      "onlinecv": "CV en ligne",
      "offlinecv": "CV à télécharger (pdf)",
      "project": " A la recherche d'un nouveau challenge, je me suis lancé dans une formation OpenClassrooms de developpeur Web, dans le but de changer de carriere.\n\n Je suis à la recherche d'une place dans une équipe de dev afin de continuer à progresser dans l'acquisition de mes compétences.\n\n Vous pourrez compte sur ma motivation, ma bonne humeur, mes capacités d'apprentissage, et à résoudre des problemes, entre autres.\n\n Je serai ravi d'en discuter, et lever vos dernieres réticences pour vous lancer avec un developpeur junior !"
    },
    "projects": {
      "title": "Projets réalisés",
      "type1": "Avec OpenClassRooms",
      "type2": "Les projets persos",
      "urlaccess": "Cliquez ici pour acceder au site",
      "urlgit": "Cliquez ici pour acceder au code sur Github",

      "project": [
      { "id": "p1",
        "github": "https://github.com/Percolateur2000/Projet2",
        "url": "https://percolateur2000.github.io/Projet2/",
        "title": "Booki - Transformer une maquette en site web avec HTML & CSS",
        "img": "./img/booki.png",
        "imgmodal": "https://user.oc-static.com/upload/2022/06/20/16557256333819_FR_1155_P3_Banner-Booki.png",
        "tags" : ["HTML ", "CSS"],
        "objective": " Le but de ce premier projet etait de me familiariser avec les bases du developpement web. Je devais utiliser les ressources fournies via Figma et sur pdf pour creer un site en HTML et CSS, et l'utilisation d'animations basiques au survol. Le site devait également etre responsif en mode Ordinateur, tablette et télephone.\n\n J'ai été évalué sur les élements suivants : \n\n- Implémenter une interface responsive\n- Intégrer du contenu conformément à une maquette"
      },
      { "id": "p2",
      "github": "https://github.com/Percolateur2000/Projet3",
      "url": "https://percolateur2000.github.io/Projet3/",
      "title": "OhMyFood - Dynamiser une page web avec des animations CSS",
      "img": "./img/ohmyfood.png",
      "imgmodal": "https://user.oc-static.com/upload/2022/06/22/16559011566667_FR_1117_P4_Banner-Ohmyfood.png",
      "tags" : ["Sass"],
      "objective": " Ce second projet mettait l'accent sur le \"Mobile first\", la création de plusieurs animations un peu plus poussées et de la navigation multi-pages.\n\n L'évaluation a porté sur les élements suivants :\n\n- Mettre en œuvre des effets CSS graphiques avancés\n- Mettre en place une structure de navigation pour un site web\n- Assurer la cohérence graphique d'un site web\n- Utiliser un système de gestion de versions pour le suivi du projet et son hébergement\n- Mettre en place son environnement Front-End"
    },
      { "id": "p3",
      "github": "https://github.com/Percolateur2000/Projet4",
      "url": "https://percolateur2000.github.io/Projet4/",
      "title": "La Panthere - Optimiser un site web existant",
      "img": "./img/panthere.png",
      "imgmodal": "https://user.oc-static.com/upload/2022/02/16/16450043954887_cover%20small.png",
      "tags" : ["SEO ","WCAG"],
      "objective": " Le troisieme projet se concentrait sur la partie SEO et l'optimisation du site, améliorer la taille et la vitesse du chargement, ainsi que l'amélioration de l'accessibilité en suivant les recommandations du WCAG.\n\n Les élements évalués sont les suivants :\n\n- Réaliser une recherche des bonnes pratiques en développement web\n- Écrire un code HTML et CSS maintenable\n- Optimiser la taille et la vitesse d’un site web\n- Assurer l'accessibilité d'un site web\n- Optimiser le référencement d'un site web"
    },
      { "id": "p4",
      "github": "https://github.com/Percolateur2000/Projet5",
      "url": "https://percolateur2000.github.io/Projet5/front/html/index.html",
      "title": "Kanap - Construire un site e-commerce en JavaScript",
      "img": "./img/kanap.png",
      "imgmodal": "https://user.oc-static.com/upload/2021/09/29/16329291678171_image2.png",
      "tags" : ["Javascript"],
      "objective": " Ce quatrieme projet introduit Javascript et les API Rest. Plusieurs pages sont existantes, et le JS doit manipuler le DOM pour afficher les elements et modificationsen temps réels.\n\n Les compétences evaluées :\n\n- Créer un plan de test pour une application\n- Valider des données issues de sources externes\n- Interagir avec un web service avec JavaScript\n- Gérer des événements JavaScript"
    },
      { "id": "p5",
      "github": "https://github.com/Percolateur2000/Projet6",
      "title": "Piiquante - Construire une API sécurisée pour une application d'avis gastronomiques",
      "img": "./img/piiquante.png",
      "imgmodal": "https://user.oc-static.com/upload/2021/07/29/16275605596354_PiiquanteLogo.png",
      "tags" : ["NodeJS ", "Express ", "MongoDB"],
      "objective": " Ce 5eme projet demandait de creer la partie backend, et la mise en relation avec une base de donnée.\n\n J'ai été évalué sur les élements suivants :\n\n- Mettre en œuvre des opérations CRUD de manière sécurisée\n- Implémenter un modèle logique de données conformément à la réglementation\n- Stocker des données de manière sécurisée"
    },
      { "id": "p6",
      "github": "https://github.com/Percolateur2000/Projet7",
      "url": "https://projet7-taupe.vercel.app/",
      "title": "Kasa - Créez une application web de location immobilière avec React",
      "img": "./img/kasa.png",
      "imgmodal": "https://user.oc-static.com/upload/2022/06/24/16560899769906_FR_811_P8_Banner-Kasa%20%281%29.png",
      "tags" : ["ReactJS"],
      "objective": " Le dernier projet OpenClassrooms avait pour theme la creation d'un site navigable en React, en utiliant les données d'un API, ainsi que l'importance des composants.\n\n Les compétences acquises sont les suivantes :\n\n- Configurer la navigation entre les pages de l'application avec React Router\n- Développer des éléments de l'interface d'un site web grâce à des composants React\n- Initialiser une application avec Create React App"
    }],
      "personalproject" : [
      { "id": "pp1",
      "github": "https://github.com/Percolateur2000/portfolio",
      "title": "Mon porfotfio - It's Showtime !",
      "img": "./img/portfolio.png",
      "tags" : ["Typescript ", "Tailwind ", "i18n"],
      "objective": " Mon premier projet en solo ! Je me suis lancé sur deux tech que je n'avais pas vu en formation. Typescript n'etait peut-etre pas adpaté à un simple portfolio, mais l'important etait de me familiariser avec ce langage \"orienté objet\".\n\n Concernant Tailwind, quelques lignes ont suffit pour en comprendre le fonctionnement, et ce portoflio pour decouvrir les subtilités et spécifications.\n\n J'ai également découvert i18next, qui m'a permis d'avoir mon site aussi en anglais d'un simple bouton, et la gestion du contenu depuis un fichier json."
    }]
    },
    "contact": {
      "me": "N'hésitez pas à me contacter !",
      "linkedin": "LinkedIn",
      "github": "Mon repo GitHub",
      "mail": "Par Mail"
    }
}
